configuration.org
#+TITLE: Config

* Emacs em geral

Afeta todos os modos.

** Zen
#+begin_src emacs-lisp
(setq +zen-text-scale 1)
#+end_src

** Espessura do divisor de janelas
#+begin_src emacs-lisp
(setq window-divider-default-bottom-width 2  ; default is 1
      window-divider-default-right-width 2)  ; default is 1
#+end_src

** Nyan Mode
#+begin_src emacs-lisp
;; (nyan-mode t)
#+end_src

** Company Mode
#+begin_src emacs-lisp
;; (defun company-yasnippet-or-completion ()
;;   (interactive)
;;   (let ((yas-fallback-behavior nil))
;;     (unless (yas-expand)
;;       (call-interactively #'company-complete-common))))

;; (after! company
;;   (add-hook 'company-mode-hook (lambda ())
;;             (substitute-key-definition 'company-complete-common
;;                                        'company-yasnippet-or-completion
;;                                        company-active-map)))
 #+end_src
** Centaur tabs
#+begin_src emacs-lisp
(setq centaur-tabs-style "wave"
      centaur-tabs-set-bar nil
      centaur-tabs-height 36
      centaur-tabs-plain-icons t
      centaur-tabs-label-fixed-length 10)

(after! centaur-tabs
  (centaur-tabs-group-by-projectile-project))
#+end_src
** Treemacs
#+begin_src emacs-lisp
(setq +treemacs-git-mode 'deferred
      treemacs-width 26
      doom-themes-treemacs-theme "doom-colors"
      doom-themes-treemacs-bitmap-indicator-width 1
      doom-themes-treemacs-enable-variable-pitch nil)
#+end_src
** Aggressive-indent
#+begin_src emacs-lisp
(aggressive-indent-global-mode +1)
#+end_src
